In [1]:
import pandas as pd

In [48]:
friend_dict_list = [
    {'name' : 'Jone', 'age' : 15, 'job' : 'student' },
    {'name' : 'Jenny', 'age' : 30, 'job' : 'developer' },
    {'name' : 'Jone', 'age' : 30, 'job' : 'teacher' }
]
df = pd.DataFrame(friend_dict_list, columns = ['name', 'age','job'])

In [49]:
df.head()

    name  age        job
0   Jone   15    student
1  Jenny   30  developer
2   Jone   30    teacher

In [50]:
df['salary'] = 0

In [51]:
df

    name  age        job  salary
0   Jone   15    student       0
1  Jenny   30  developer       0
2   Jone   30    teacher       0

In [52]:
import numpy as np

In [53]:
df['salary'] = np.where(df['job'] != 'student', 'yes', 'no')

In [54]:
df

    name  age        job salary
0   Jone   15    student     no
1  Jenny   30  developer    yes
2   Jone   30    teacher    yes

In [55]:
friend_dict_list = [
    {'name' : 'Jone', 'meidterm' : 95, 'final' : 85 },
    {'name' : 'Jenny', 'meidterm' : 85, 'final' : 80 },
    {'name' : 'Jone', 'meidterm' : 30, 'final' : 10 }
]
df = pd.DataFrame(friend_dict_list, columns = ['name', 'meidterm','final'])

In [56]:
df

    name  meidterm  final
0   Jone        95     85
1  Jenny        85     80
2   Jone        30     10

In [57]:
df['total'] = df['meidterm'] + df['final']

In [58]:
df.head()

    name  meidterm  final  total
0   Jone        95     85    180
1  Jenny        85     80    165
2   Jone        30     10     40

In [59]:
df['average'] = df['total'] / 2

In [60]:
df

    name  meidterm  final  total  average
0   Jone        95     85    180     90.0
1  Jenny        85     80    165     82.5
2   Jone        30     10     40     20.0

In [61]:
grades = []
for row in df['average']:
    if row >= 90:
        grades.append('A')
    elif row >= 80:
        grades.append('B')
    else:
        grades.append('F')
df['grade'] = grades

In [62]:
df

    name  meidterm  final  total  average grade
0   Jone        95     85    180     90.0     A
1  Jenny        85     80    165     82.5     B
2   Jone        30     10     40     20.0     F

In [63]:
def pass_or_fail(row):
    if row != 'F':
        return"Pass"
    else:
        return"Fail"

In [64]:
df.grade = df.grade.apply(pass_or_fail)

In [65]:
df

    name  meidterm  final  total  average grade
0   Jone        95     85    180     90.0  Pass
1  Jenny        85     80    165     82.5  Pass
2   Jone        30     10     40     20.0  Fail

In [66]:
date_list = [
    {
        'yyyy-mm-dd' : '2000-06-27'
    },
    {
        'yyyy-mm-dd' : '2007-10-27'
    },
]
df = pd.DataFrame(date_list, columns = ['yyyy-mm-dd'])

In [67]:
df.head()

   yyyy-mm-dd
0  2000-06-27
1  2007-10-27

In [68]:
def extract_year(row):
    return row.split('-')[0]

In [69]:
df['year'] = df['yyyy-mm-dd'].apply(extract_year)

In [70]:
df.head()

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2007-10-27  2007

In [71]:
friend_dict_list = [
    {'name' : 'Jone', 'meidterm' : 95, 'final' : 85 },
    {'name' : 'Jenny', 'meidterm' : 85, 'final' : 80 },
    {'name' : 'Jone', 'meidterm' : 30, 'final' : 10 }
]
df = pd.DataFrame(friend_dict_list, columns = ['name', 'meidterm','final'])

In [72]:
df

    name  meidterm  final
0   Jone        95     85
1  Jenny        85     80
2   Jone        30     10

In [73]:
df2 = pd.DataFrame([
    ['Ben', 50, 50]
], columns = ['name', 'meidterm', 'final'])

In [74]:
df2.head()

  name  meidterm  final
0  Ben        50     50

In [75]:
df.append(df2, ignore_index = True)

    name  meidterm  final
0   Jone        95     85
1  Jenny        85     80
2   Jone        30     10
3    Ben        50     50